# Завдання
# Для бази даних Академія, яку ви розробили в рамках
# курсу «Теорія Баз Даних», створіть додаток для взаємодії
# з базою даних, який дозволяє:
# ■ вставляти рядки в таблиці бази даних;
# ■ оновлювати рядків у таблицях бази даних;
# ■ видаляти рядки з таблиць бази даних;
# ■ створювати звіти:
# ▷ вивести інформацію про всі навчальні групи,
# ▷ вивести інформацію про всіх викладачів,
# ▷ вивести назви усіх кафедр,
# ▷ вивести імена та прізвища викладачів, які читають
# лекції в конкретній групі,
# ▷ вивести назви кафедр і груп, які до них відносяться,
# ▷ відобразити кафедру з максимальною кількістю груп,
# ▷ відобразити кафедру з мінімальною кількістю груп,
# ▷ вивести назви предметів, які викладає конкретний
# викладач,
# ▷ вивести назви кафедр, на яких викладається конкретна дисципліна,
# вивести назви груп, що належать до конкретного
# факультету,
# ▷ вивести назви предметів та повні імена викладачів,
# які читають найбільшу кількість лекцій з них,
# ▷ вивести назву предмету, за яким читається найменше лекцій,
# ▷ вивести назву предмету, за яким читається найбільше лекцій;
# ■ передбачити можливість збереження звітів з результатів роботи на екран або у файл (встановлюється в
# налаштуваннях додатку);
# ■ передбачити можливість входу з різними рівнями доступу. Наприклад: доступ лише для читання, доступ
# для читання та запис, доступ для читання певних
# таблиць.